99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/display_buffer/esp32_mquickjs_display_buffer_draw.c
#include "esp32_mquickjs_display_buffer_internal.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_DISPLAY_BUFFER

#include <limits.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include "esp_heap_caps.h"

#define DISPLAY_BUFFER_STACK_POINTS 32U

typedef struct {
    int32_t x;
    int32_t y;
} display_buffer_point_t;

static uint32_t abs_i32_to_u32(int32_t value)
{
    return value < 0 ? (uint32_t)(-(int64_t)value) : (uint32_t)value;
}

static uint32_t clamp_radius_u32(uint32_t value)
{
    return value > DISPLAY_BUFFER_MAX_DIMENSION ? DISPLAY_BUFFER_MAX_DIMENSION : value;
}

static uint32_t isqrt_u64(uint64_t value)
{
    uint64_t result = 0;
    uint64_t bit = 1ULL << 62;

    while (bit > value) {
        bit >>= 2;
    }
    while (bit != 0) {
        if (value >= result + bit) {
            value -= result + bit;
            result = (result >> 1) + bit;
        } else {
            result >>= 1;
        }
        bit >>= 2;
    }
    return (uint32_t)result;
}

static void fill_span_raw(esp32_mquickjs_display_buffer_t *buffer,
                          int64_t x0,
                          int y,
                          int64_t x1,
                          uint16_t color,
                          int *dirty_x0,
                          int *dirty_y0,
                          int *dirty_x1,
                          int *dirty_y1)
{
    int clipped_x0;
    int clipped_x1;

    if (y < 0 || y >= buffer->height || x1 < x0 || x1 < 0 || x0 >= buffer->width) {
        return;
    }
    clipped_x0 = x0 < 0 ? 0 : (int)x0;
    clipped_x1 = x1 >= buffer->width ? buffer->width - 1 : (int)x1;
    fill_rect_raw(buffer, clipped_x0, y, clipped_x1 - clipped_x0 + 1, 1, color, false);
    if (clipped_x0 < *dirty_x0) {
        *dirty_x0 = clipped_x0;
    }
    if (y < *dirty_y0) {
        *dirty_y0 = y;
    }
    if (clipped_x1 > *dirty_x1) {
        *dirty_x1 = clipped_x1;
    }
    if (y > *dirty_y1) {
        *dirty_y1 = y;
    }
}

static void set_pixel_dirty_raw(esp32_mquickjs_display_buffer_t *buffer,
                                int x,
                                int y,
                                uint16_t color,
                                int *dirty_x0,
                                int *dirty_y0,
                                int *dirty_x1,
                                int *dirty_y1)
{
    if (x < 0 || y < 0 || x >= buffer->width || y >= buffer->height) {
        return;
    }
    set_pixel_raw(buffer, x, y, color);
    if (x < *dirty_x0) {
        *dirty_x0 = x;
    }
    if (y < *dirty_y0) {
        *dirty_y0 = y;
    }
    if (x > *dirty_x1) {
        *dirty_x1 = x;
    }
    if (y > *dirty_y1) {
        *dirty_y1 = y;
    }
}

static bool vertical_radius_range(int32_t center, uint32_t radius, int limit, int *out_start, int *out_end)
{
    int64_t start = (int64_t)center - radius;
    int64_t end = (int64_t)center + radius;

    if (end < 0 || start >= limit) {
        return false;
    }
    *out_start = start < 0 ? 0 : (int)start;
    *out_end = end >= limit ? limit - 1 : (int)end;
    return *out_start <= *out_end;
}

static bool horizontal_radius_range(int32_t center, uint32_t radius, int limit, int *out_start, int *out_end)
{
    int64_t start = (int64_t)center - radius;
    int64_t end = (int64_t)center + radius;

    if (end < 0 || start >= limit) {
        return false;
    }
    *out_start = start < 0 ? 0 : (int)start;
    *out_end = end >= limit ? limit - 1 : (int)end;
    return *out_start <= *out_end;
}

static void mark_dirty_if_touched(esp32_mquickjs_display_buffer_t *buffer,
                                  int dirty_x0,
                                  int dirty_y0,
                                  int dirty_x1,
                                  int dirty_y1)
{
    if (dirty_x1 >= dirty_x0 && dirty_y1 >= dirty_y0) {
        mark_dirty(buffer, dirty_x0, dirty_y0, dirty_x1 - dirty_x0 + 1, dirty_y1 - dirty_y0 + 1);
    }
}

static void draw_circle_raw(esp32_mquickjs_display_buffer_t *buffer,
                            int32_t cx,
                            int32_t cy,
                            uint32_t radius,
                            uint16_t color)
{
    int dirty_x0 = buffer->width;
    int dirty_y0 = buffer->height;
    int dirty_x1 = -1;
    int dirty_y1 = -1;
    int x;
    int y = 0;
    int err;

    radius = clamp_radius_u32(radius);
    x = (int)radius;
    err = 1 - x;
    if (radius == 0) {
        set_pixel_dirty_raw(buffer, cx, cy, color, &dirty_x0, &dirty_y0, &dirty_x1, &dirty_y1);
        mark_dirty_if_touched(buffer, dirty_x0, dirty_y0, dirty_x1, dirty_y1);
        return;
    }

    while (x >= y) {
        set_pixel_dirty_raw(buffer, cx + x, cy + y, color, &dirty_x0, &dirty_y0, &dirty_x1, &dirty_y1);
        set_pixel_dirty_raw(buffer, cx + y, cy + x, color, &dirty_x0, &dirty_y0, &dirty_x1, &dirty_y1);
        set_pixel_dirty_raw(buffer, cx - y, cy + x, color, &dirty_x0, &dirty_y0, &dirty_x1, &dirty_y1);
        set_pixel_dirty_raw(buffer, cx - x, cy + y, color, &dirty_x0, &dirty_y0, &dirty_x1, &dirty_y1);
        set_pixel_dirty_raw(buffer, cx - x, cy - y, color, &dirty_x0, &dirty_y0, &dirty_x1, &dirty_y1);
        set_pixel_dirty_raw(buffer, cx - y, cy - x, color, &dirty_x0, &dirty_y0, &dirty_x1, &dirty_y1);
        set_pixel_dirty_raw(buffer, cx + y, cy - x, color, &dirty_x0, &dirty_y0, &dirty_x1, &dirty_y1);
        set_pixel_dirty_raw(buffer, cx + x, cy - y, color, &dirty_x0, &dirty_y0, &dirty_x1, &dirty_y1);
        y++;
        if (err < 0) {
            err += (y << 1) + 1;
        } else {
            x--;
            err += ((y - x) << 1) + 1;
        }
    }
    mark_dirty_if_touched(buffer, dirty_x0, dirty_y0, dirty_x1, dirty_y1);
}

static void fill_circle_raw(esp32_mquickjs_display_buffer_t *buffer,
                            int32_t cx,
                            int32_t cy,
                            uint32_t radius,
                            uint16_t color)
{
    int dirty_x0 = buffer->width;
    int dirty_y0 = buffer->height;
    int dirty_x1 = -1;
    int dirty_y1 = -1;
    int start_y;
    int end_y;
    uint64_t rr;
    int y;

