99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/display_buffer/esp32_mquickjs_display_buffer_draw.c
static void expand_line_bounds(int x0,
                               int y0,
                               int x1,
                               int y1,
                               int *min_x,
                               int *min_y,
                               int *max_x,
                               int *max_y)
{
    if (x0 < *min_x) {
        *min_x = x0;
    }
    if (x1 < *min_x) {
        *min_x = x1;
    }
    if (y0 < *min_y) {
        *min_y = y0;
    }
    if (y1 < *min_y) {
        *min_y = y1;
    }
    if (x0 > *max_x) {
        *max_x = x0;
    }
    if (x1 > *max_x) {
        *max_x = x1;
    }
    if (y0 > *max_y) {
        *max_y = y0;
    }
    if (y1 > *max_y) {
        *max_y = y1;
    }
}

void draw_line_raw(esp32_mquickjs_display_buffer_t *buffer,
                   int x0,
                   int y0,
                   int x1,
                   int y1,
                   uint16_t color)
{
    int dx = x1 >= x0 ? x1 - x0 : x0 - x1;
    int sx = x0 < x1 ? 1 : -1;
    int dy_abs = y1 >= y0 ? y1 - y0 : y0 - y1;
    int dy = -dy_abs;
    int sy = y0 < y1 ? 1 : -1;
    int err = dx + dy;

    while (true) {
        int e2;

        set_pixel_raw(buffer, x0, y0, color);
        if (x0 == x1 && y0 == y1) {
            break;
        }
        e2 = err << 1;
        if (e2 >= dy) {
            err += dy;
            x0 += sx;
        }
        if (e2 <= dx) {
            err += dx;
            y0 += sy;
        }
    }
}

void draw_rect_raw(esp32_mquickjs_display_buffer_t *buffer,
                   int32_t x,
                   int32_t y,
                   int32_t width,
                   int32_t height,
                   uint16_t color)
{
    if (width <= 0 || height <= 0) {
        return;
    }
    draw_line_raw(buffer, x, y, x + width - 1, y, color);
    draw_line_raw(buffer, x, y + height - 1, x + width - 1, y + height - 1, color);
    draw_line_raw(buffer, x, y, x, y + height - 1, color);
    draw_line_raw(buffer, x + width - 1, y, x + width - 1, y + height - 1, color);
    mark_dirty(buffer, x, y, width, height);
}

void draw_round_rect_raw(esp32_mquickjs_display_buffer_t *buffer,
                         int32_t x,
                         int32_t y,
                         int32_t width,
                         int32_t height,
                         uint32_t radius,
                         uint16_t color)
{
    int32_t r;
    int32_t cx0;
    int32_t cx1;
    int32_t cy0;
    int32_t cy1;
    int px;
    int py = 0;
    int err;

    if (width <= 0 || height <= 0) {
        return;
    }
    r = (int32_t)clamp_radius_u32(radius);
    if (r > width / 2) {
        r = width / 2;
    }
    if (r > height / 2) {
        r = height / 2;
    }
    if (r <= 0) {
        draw_line_raw(buffer, x, y, x + width - 1, y, color);
        draw_line_raw(buffer, x, y + height - 1, x + width - 1, y + height - 1, color);
        draw_line_raw(buffer, x, y, x, y + height - 1, color);
        draw_line_raw(buffer, x + width - 1, y, x + width - 1, y + height - 1, color);
        mark_dirty(buffer, x, y, width, height);
        return;
    }

    cx0 = x + r;
    cx1 = x + width - r - 1;
    cy0 = y + r;
    cy1 = y + height - r - 1;
    draw_line_raw(buffer, cx0, y, cx1, y, color);
    draw_line_raw(buffer, cx0, y + height - 1, cx1, y + height - 1, color);
    draw_line_raw(buffer, x, cy0, x, cy1, color);
    draw_line_raw(buffer, x + width - 1, cy0, x + width - 1, cy1, color);

    px = r;
    err = 1 - px;
    while (px >= py) {
        set_pixel_raw(buffer, cx0 - px, cy0 - py, color);
        set_pixel_raw(buffer, cx0 - py, cy0 - px, color);
        set_pixel_raw(buffer, cx1 + px, cy0 - py, color);
        set_pixel_raw(buffer, cx1 + py, cy0 - px, color);
        set_pixel_raw(buffer, cx0 - px, cy1 + py, color);
        set_pixel_raw(buffer, cx0 - py, cy1 + px, color);
        set_pixel_raw(buffer, cx1 + px, cy1 + py, color);
        set_pixel_raw(buffer, cx1 + py, cy1 + px, color);
        py++;
        if (err < 0) {
            err += (py << 1) + 1;
        } else {
            px--;
            err += ((py - px) << 1) + 1;
        }
    }
    mark_dirty(buffer, x, y, width, height);
}

void fill_round_rect_raw(esp32_mquickjs_display_buffer_t *buffer,
                         int32_t x,
                         int32_t y,
                         int32_t width,
                         int32_t height,
                         uint32_t radius,
                         uint16_t color)
{
    int32_t r;
    uint64_t rr;
    int dy;

    if (width <= 0 || height <= 0) {
        return;
    }
    r = (int32_t)clamp_radius_u32(radius);
    if (r > width / 2) {
        r = width / 2;
    }
    if (r > height / 2) {
        r = height / 2;
    }
    if (r <= 0) {
        fill_rect_raw(buffer, x, y, width, height, color, true);
        return;
    }

    fill_rect_raw(buffer, x, y + r, width, height - r * 2, color, false);
    rr = (uint64_t)r * r;
    for (dy = 0; dy < r; ++dy) {
        int32_t edge_y = r - dy;
        int32_t span = (int32_t)isqrt_u64(rr - (uint64_t)edge_y * edge_y);
        int32_t row_x = x + r - span;
        int32_t row_width = width - r * 2 + span * 2;

        if (row_width > 0) {
            fill_rect_raw(buffer, row_x, y + dy, row_width, 1, color, false);
            fill_rect_raw(buffer, row_x, y + height - 1 - dy, row_width, 1, color, false);
        }
    }
    mark_dirty(buffer, x, y, width, height);
}

static void draw_quadratic_bezier_raw(esp32_mquickjs_display_buffer_t *buffer,
                                      int32_t x0,
                                      int32_t y0,
                                      int32_t cx,
                                      int32_t cy,
                                      int32_t x1,
                                      int32_t y1,
                                      uint16_t color,
                                      uint32_t segments)
{
    int prev_x = x0;
    int prev_y = y0;
    int min_x = x0;
    int min_y = y0;
    int max_x = x0;
    int max_y = y0;
    uint32_t i;

    for (i = 1; i <= segments; ++i) {
        double t = (double)i / (double)segments;
        double mt = 1.0 - t;
        int x = round_double_to_i32(mt * mt * x0 + 2.0 * mt * t * cx + t * t * x1);
        int y = round_double_to_i32(mt * mt * y0 + 2.0 * mt * t * cy + t * t * y1);

        draw_line_raw(buffer, prev_x, prev_y, x, y, color);
        expand_line_bounds(prev_x, prev_y, x, y, &min_x, &min_y, &max_x, &max_y);
        prev_x = x;
        prev_y = y;
    }
    mark_dirty(buffer, min_x, min_y, max_x - min_x + 1, max_y - min_y + 1);
}

static void draw_cubic_bezier_raw(esp32_mquickjs_display_buffer_t *buffer,
                                  int32_t x0,
                                  int32_t y0,
                                  int32_t c1x,
                                  int32_t c1y,
                                  int32_t c2x,
                                  int32_t c2y,
                                  int32_t x1,
                                  int32_t y1,
                                  uint16_t color,
                                  uint32_t segments)
{
    int prev_x = x0;
    int prev_y = y0;
    int min_x = x0;
    int min_y = y0;
    int max_x = x0;
    int max_y = y0;
    uint32_t i;

    for (i = 1; i <= segments; ++i) {
        double t = (double)i / (double)segments;
        double mt = 1.0 - t;
        double mt2 = mt * mt;
        double t2 = t * t;
        int x = round_double_to_i32(mt2 * mt * x0 + 3.0 * mt2 * t * c1x + 3.0 * mt * t2 * c2x + t2 * t * x1);
        int y = round_double_to_i32(mt2 * mt * y0 + 3.0 * mt2 * t * c1y + 3.0 * mt * t2 * c2y + t2 * t * y1);

        draw_line_raw(buffer, prev_x, prev_y, x, y, color);
        expand_line_bounds(prev_x, prev_y, x, y, &min_x, &min_y, &max_x, &max_y);
        prev_x = x;
        prev_y = y;
    }
    mark_dirty(buffer, min_x, min_y, max_x - min_x + 1, max_y - min_y + 1);
}

