99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/display_buffer/esp32_mquickjs_display_buffer_draw.c
JSValue js_display_buffer_draw_ellipse(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    int32_t cx;
    int32_t cy;
    int32_t rx;
    int32_t ry;
    uint16_t color;
    bool ok;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.drawEllipse()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 4 || !value_to_i32(ctx, argv[0], &cx) || !value_to_i32(ctx, argv[1], &cy) ||
        !value_to_i32(ctx, argv[2], &rx) || !value_to_i32(ctx, argv[3], &ry)) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.drawEllipse(cx, cy, rx, ry, color) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 5 ? argv[4] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.drawEllipse(cx, cy, rx, ry, color) expects a valid color");
    }
    draw_ellipse_raw(buffer, cx, cy, abs_i32_to_u32(rx), abs_i32_to_u32(ry), color);
    return *this_val;
}

JSValue js_display_buffer_fill_ellipse(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    int32_t cx;
    int32_t cy;
    int32_t rx;
    int32_t ry;
    uint16_t color;
    bool ok;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.fillEllipse()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 4 || !value_to_i32(ctx, argv[0], &cx) || !value_to_i32(ctx, argv[1], &cy) ||
        !value_to_i32(ctx, argv[2], &rx) || !value_to_i32(ctx, argv[3], &ry)) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.fillEllipse(cx, cy, rx, ry, color) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 5 ? argv[4] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.fillEllipse(cx, cy, rx, ry, color) expects a valid color");
    }
    fill_ellipse_raw(buffer, cx, cy, abs_i32_to_u32(rx), abs_i32_to_u32(ry), color);
    return *this_val;
}

JSValue js_display_buffer_draw_rect(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;
    uint16_t color;
    bool ok;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.drawRect()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (!rect_from_args(ctx, argc, argv, &x, &y, &width, &height, "DisplayBuffer.drawRect()")) {
        return JS_EXCEPTION;
    }
    if (width <= 0 || height <= 0) {
        return *this_val;
    }
    color = normalize_color(ctx, buffer->format, argc >= 5 ? argv[4] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.drawRect(x, y, width, height, color) expects a valid color");
    }
    draw_rect_raw(buffer, x, y, width, height, color);
    return *this_val;
}

JSValue js_display_buffer_draw_round_rect(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;
    int32_t radius;
    uint16_t color;
    bool ok;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.drawRoundRect()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 5 || !value_to_i32(ctx, argv[0], &x) || !value_to_i32(ctx, argv[1], &y) ||
        !value_to_i32(ctx, argv[2], &width) || !value_to_i32(ctx, argv[3], &height) ||
        !value_to_i32(ctx, argv[4], &radius)) {
        return JS_ThrowTypeError(ctx,
                                 "DisplayBuffer.drawRoundRect(x, y, width, height, radius, color) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 6 ? argv[5] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.drawRoundRect(x, y, width, height, radius, color) expects a valid color");
    }
    draw_round_rect_raw(buffer, x, y, width, height, abs_i32_to_u32(radius), color);
    return *this_val;
}

JSValue js_display_buffer_fill_round_rect(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;
    int32_t radius;
    uint16_t color;
    bool ok;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.fillRoundRect()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 5 || !value_to_i32(ctx, argv[0], &x) || !value_to_i32(ctx, argv[1], &y) ||
        !value_to_i32(ctx, argv[2], &width) || !value_to_i32(ctx, argv[3], &height) ||
        !value_to_i32(ctx, argv[4], &radius)) {
        return JS_ThrowTypeError(ctx,
                                 "DisplayBuffer.fillRoundRect(x, y, width, height, radius, color) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 6 ? argv[5] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.fillRoundRect(x, y, width, height, radius, color) expects a valid color");
    }
    fill_round_rect_raw(buffer, x, y, width, height, abs_i32_to_u32(radius), color);
    return *this_val;
}

JSValue js_display_buffer_draw_line(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    int32_t x0;
    int32_t y0;
    int32_t x1;
    int32_t y1;
    uint16_t color;
    bool ok;
    int min_x;
    int min_y;
    int max_x;
    int max_y;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.drawLine()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 4 || !value_to_i32(ctx, argv[0], &x0) || !value_to_i32(ctx, argv[1], &y0) ||
        !value_to_i32(ctx, argv[2], &x1) || !value_to_i32(ctx, argv[3], &y1)) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.drawLine(x0, y0, x1, y1, color) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 5 ? argv[4] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "DisplayBuffer.drawLine(x0, y0, x1, y1, color) expects a valid color");
    }
    draw_line_raw(buffer, x0, y0, x1, y1, color);
    min_x = x0 < x1 ? x0 : x1;
    min_y = y0 < y1 ? y0 : y1;
    max_x = x0 > x1 ? x0 : x1;
    max_y = y0 > y1 ? y0 : y1;
    mark_dirty(buffer, min_x, min_y, max_x - min_x + 1, max_y - min_y + 1);
    return *this_val;
}

static JSValue draw_point_list(JSContext *ctx,
                               JSValue *this_val,
                               int argc,
                               JSValue *argv,
                               const char *api_name,
                               bool closed)
{
    esp32_mquickjs_display_buffer_t *buffer;
    display_buffer_point_t stack_points[DISPLAY_BUFFER_STACK_POINTS];
    display_buffer_point_t *points = NULL;
    uint32_t count = 0;
    uint16_t color;
    bool ok;
    bool owns_points = false;

    buffer = display_buffer_from_value(ctx, *this_val, api_name);
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 1 || !parse_point_list(ctx,
                                      argv[0],
                                      api_name,
                                      stack_points,
                                      DISPLAY_BUFFER_STACK_POINTS,
                                      &points,
                                      &count,
                                      &owns_points)) {
        return JS_EXCEPTION;
    }
    color = normalize_color(ctx, buffer->format, argc >= 2 ? argv[1] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        if (owns_points) {
            heap_caps_free(points);
        }
        return JS_ThrowTypeError(ctx, "%s expects a valid color", api_name);
    }
    draw_polyline_raw(buffer, points, count, closed, color);
    if (owns_points) {
        heap_caps_free(points);
    }
    return *this_val;
}

JSValue js_display_buffer_draw_polyline(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    return draw_point_list(ctx, this_val, argc, argv, "DisplayBuffer.drawPolyline(points, color)", false);
}

