99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/display_buffer/esp32_mquickjs_display_buffer_draw.c
JSValue js_display_buffer_draw_polygon(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    return draw_point_list(ctx, this_val, argc, argv, "DisplayBuffer.drawPolygon(points, color)", true);
}

JSValue js_display_buffer_fill_polygon(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    display_buffer_point_t stack_points[DISPLAY_BUFFER_STACK_POINTS];
    display_buffer_point_t *points = NULL;
    int64_t stack_intersections[DISPLAY_BUFFER_STACK_POINTS];
    uint32_t count = 0;
    uint16_t color;
    bool ok;
    bool owns_points = false;
    bool filled;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.fillPolygon()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 1 || !parse_point_list(ctx,
                                      argv[0],
                                      "DisplayBuffer.fillPolygon(points, color)",
                                      stack_points,
                                      DISPLAY_BUFFER_STACK_POINTS,
                                      &points,
                                      &count,
                                      &owns_points)) {
        return JS_EXCEPTION;
    }
    color = normalize_color(ctx, buffer->format, argc >= 2 ? argv[1] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        if (owns_points) {
            heap_caps_free(points);
        }
        return JS_ThrowTypeError(ctx, "DisplayBuffer.fillPolygon(points, color) expects a valid color");
    }
    filled = fill_polygon_raw(buffer, points, count, color, stack_intersections, DISPLAY_BUFFER_STACK_POINTS);
    if (owns_points) {
        heap_caps_free(points);
    }
    if (!filled) {
        return JS_ThrowOutOfMemory(ctx);
    }
    return *this_val;
}

JSValue js_display_buffer_draw_triangle(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    display_buffer_point_t points[3];
    uint16_t color;
    bool ok;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.drawTriangle()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 6 ||
        !value_to_i32(ctx, argv[0], &points[0].x) ||
        !value_to_i32(ctx, argv[1], &points[0].y) ||
        !value_to_i32(ctx, argv[2], &points[1].x) ||
        !value_to_i32(ctx, argv[3], &points[1].y) ||
        !value_to_i32(ctx, argv[4], &points[2].x) ||
        !value_to_i32(ctx, argv[5], &points[2].y)) {
        return JS_ThrowTypeError(ctx,
                                 "DisplayBuffer.drawTriangle(x0, y0, x1, y1, x2, y2, color) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 7 ? argv[6] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx,
                                 "DisplayBuffer.drawTriangle(x0, y0, x1, y1, x2, y2, color) expects a valid color");
    }
    draw_polyline_raw(buffer, points, 3, true, color);
    return *this_val;
}

JSValue js_display_buffer_fill_triangle(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    display_buffer_point_t points[3];
    int64_t intersections[3];
    uint16_t color;
    bool ok;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.fillTriangle()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 6 ||
        !value_to_i32(ctx, argv[0], &points[0].x) ||
        !value_to_i32(ctx, argv[1], &points[0].y) ||
        !value_to_i32(ctx, argv[2], &points[1].x) ||
        !value_to_i32(ctx, argv[3], &points[1].y) ||
        !value_to_i32(ctx, argv[4], &points[2].x) ||
        !value_to_i32(ctx, argv[5], &points[2].y)) {
        return JS_ThrowTypeError(ctx,
                                 "DisplayBuffer.fillTriangle(x0, y0, x1, y1, x2, y2, color) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 7 ? argv[6] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx,
                                 "DisplayBuffer.fillTriangle(x0, y0, x1, y1, x2, y2, color) expects a valid color");
    }
    if (!fill_polygon_raw(buffer, points, 3, color, intersections, 3)) {
        return JS_ThrowOutOfMemory(ctx);
    }
    return *this_val;
}

JSValue js_display_buffer_draw_quadratic_bezier(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    int32_t x0;
    int32_t y0;
    int32_t cx;
    int32_t cy;
    int32_t x1;
    int32_t y1;
    uint32_t segments;
    uint16_t color;
    bool ok;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.drawQuadraticBezier()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 6 ||
        !value_to_i32(ctx, argv[0], &x0) ||
        !value_to_i32(ctx, argv[1], &y0) ||
        !value_to_i32(ctx, argv[2], &cx) ||
        !value_to_i32(ctx, argv[3], &cy) ||
        !value_to_i32(ctx, argv[4], &x1) ||
        !value_to_i32(ctx, argv[5], &y1)) {
        return JS_ThrowTypeError(ctx,
                                 "DisplayBuffer.drawQuadraticBezier(x0, y0, cx, cy, x1, y1, color, options) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 7 ? argv[6] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx,
                                 "DisplayBuffer.drawQuadraticBezier(x0, y0, cx, cy, x1, y1, color, options) expects a valid color");
    }
    if (!curve_segments_from_options(ctx,
                                     argc >= 8 ? argv[7] : JS_UNDEFINED,
                                     24,
                                     "DisplayBuffer.drawQuadraticBezier()",
                                     &segments)) {
        return JS_EXCEPTION;
    }
    draw_quadratic_bezier_raw(buffer, x0, y0, cx, cy, x1, y1, color, segments);
    return *this_val;
}

JSValue js_display_buffer_draw_cubic_bezier(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_display_buffer_t *buffer;
    int32_t x0;
    int32_t y0;
    int32_t c1x;
    int32_t c1y;
    int32_t c2x;
    int32_t c2y;
    int32_t x1;
    int32_t y1;
    uint32_t segments;
    uint16_t color;
    bool ok;

    buffer = display_buffer_from_value(ctx, *this_val, "DisplayBuffer.drawCubicBezier()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 8 ||
        !value_to_i32(ctx, argv[0], &x0) ||
        !value_to_i32(ctx, argv[1], &y0) ||
        !value_to_i32(ctx, argv[2], &c1x) ||
        !value_to_i32(ctx, argv[3], &c1y) ||
        !value_to_i32(ctx, argv[4], &c2x) ||
        !value_to_i32(ctx, argv[5], &c2y) ||
        !value_to_i32(ctx, argv[6], &x1) ||
        !value_to_i32(ctx, argv[7], &y1)) {
        return JS_ThrowTypeError(ctx,
                                 "DisplayBuffer.drawCubicBezier(x0, y0, c1x, c1y, c2x, c2y, x1, y1, color, options) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 9 ? argv[8] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx,
                                 "DisplayBuffer.drawCubicBezier(x0, y0, c1x, c1y, c2x, c2y, x1, y1, color, options) expects a valid color");
    }
    if (!curve_segments_from_options(ctx,
                                     argc >= 10 ? argv[9] : JS_UNDEFINED,
                                     32,
                                     "DisplayBuffer.drawCubicBezier()",
                                     &segments)) {
        return JS_EXCEPTION;
    }
    draw_cubic_bezier_raw(buffer, x0, y0, c1x, c1y, c2x, c2y, x1, y1, color, segments);
    return *this_val;
}

